Microchip-MPLAB-Harmony/csp/apps/dacc/dacc_wav_gen/firmware/src/packs/ATSAMV71Q21B_DFP/component/i2sc.h
/* -------- I2SC_THR : (I2SC Offset: 0x24) ( /W 32) Transmitter Holding Register -------- */
#define I2SC_THR_THR_Pos                      (0U)                                           /**< (I2SC_THR) Transmitter Holding Register Position */
#define I2SC_THR_THR_Msk                      (0xFFFFFFFFU << I2SC_THR_THR_Pos)              /**< (I2SC_THR) Transmitter Holding Register Mask */
#define I2SC_THR_THR(value)                   (I2SC_THR_THR_Msk & ((value) << I2SC_THR_THR_Pos))
#define I2SC_THR_Msk                          (0xFFFFFFFFUL)                                 /**< (I2SC_THR) Register Mask  */

/** \brief I2SC register offsets definitions */
#define I2SC_CR_OFFSET                 (0x00)         /**< (I2SC_CR) Control Register Offset */
#define I2SC_MR_OFFSET                 (0x04)         /**< (I2SC_MR) Mode Register Offset */
#define I2SC_SR_OFFSET                 (0x08)         /**< (I2SC_SR) Status Register Offset */
#define I2SC_SCR_OFFSET                (0x0C)         /**< (I2SC_SCR) Status Clear Register Offset */
#define I2SC_SSR_OFFSET                (0x10)         /**< (I2SC_SSR) Status Set Register Offset */
#define I2SC_IER_OFFSET                (0x14)         /**< (I2SC_IER) Interrupt Enable Register Offset */
#define I2SC_IDR_OFFSET                (0x18)         /**< (I2SC_IDR) Interrupt Disable Register Offset */
#define I2SC_IMR_OFFSET                (0x1C)         /**< (I2SC_IMR) Interrupt Mask Register Offset */
#define I2SC_RHR_OFFSET                (0x20)         /**< (I2SC_RHR) Receiver Holding Register Offset */
#define I2SC_THR_OFFSET                (0x24)         /**< (I2SC_THR) Transmitter Holding Register Offset */

/** \brief I2SC register API structure */
typedef struct
{
  __O   uint32_t                       I2SC_CR;         /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       I2SC_MR;         /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint32_t                       I2SC_SR;         /**< Offset: 0x08 (R/   32) Status Register */
  __O   uint32_t                       I2SC_SCR;        /**< Offset: 0x0c ( /W  32) Status Clear Register */
  __O   uint32_t                       I2SC_SSR;        /**< Offset: 0x10 ( /W  32) Status Set Register */
  __O   uint32_t                       I2SC_IER;        /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       I2SC_IDR;        /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       I2SC_IMR;        /**< Offset: 0x1c (R/   32) Interrupt Mask Register */
  __I   uint32_t                       I2SC_RHR;        /**< Offset: 0x20 (R/   32) Receiver Holding Register */
  __O   uint32_t                       I2SC_THR;        /**< Offset: 0x24 ( /W  32) Transmitter Holding Register */
} i2sc_registers_t;
/** @}  end of Inter-IC Sound Controller */

#endif /* SAMV_SAMV71_I2SC_MODULE_H */

